/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Επέκταση Telesec";
"06 06 02 82 06 01 0A 01"		= "Μηχανισμός Telesec";

"06 07 02 82 06 01 0A 01 00"	= "Έλεγχος ταυτότητας Telesec";
"06 08 02 82 06 01 0A 01 00 01"	= "Ταυτοποίηση συνθηματικού";
"06 08 02 82 06 01 0A 01 00 02" = "Έλεγχος ταυτότητας με προστασία με συνθηματικό";
"06 08 02 82 06 01 0A 01 00 03" = "Μονόδρομος έλεγχος ταυτότητας X.509";
"06 08 02 82 06 01 0A 01 00 04" = "Αμφίδρομος έλεγχος ταυτότητας X.509";
"06 08 02 82 06 01 0A 01 00 05" = "Τρίδρομος έλεγχος ταυτότητας X.509";
"06 08 02 82 06 01 0A 01 00 06" = "Μονόδρομος έλεγχος ταυτότητας ISO9798";
"06 08 02 82 06 01 0A 01 00 07" = "Αμφίδρομος έλεγχος ταυτότητας ISO9798";
"06 08 02 82 06 01 0A 01 00 08" = "Έλεγχος ταυτότητας Telekom";

"06 07 02 82 06 01 0A 01 01"	= "Υπογραφή Telesec";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 με RSA και ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 με τυπική υπογραφή RSA και Telesec";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 με RSA και ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 με τυπική υπογραφή RSA και Telesec";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 με τυπική υπογραφή RSA και Telekom";
"06 08 02 82 06 01 0A 01 01 09"	= "Υπογραφή HBCI RSA";

"06 07 02 82 06 01 0A 01 02"	= "Κρυπτογράφηση Telesec";
"06 08 02 82 06 01 0A 01 02 00"	= "κανένα";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Μονόδρομη λειτουργία";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Hash που χρησιμοποιεί κρυπτοθέτηση φραγής";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "Λειτουργία FEC";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Υπομονάδα Telesec";
"06 07 02 82 06 01 0A 02 00"	= "Αλγόριθμοι";
"06 07 02 82 06 01 0A 02 01"	= "Τύποι χαρακτηριστικών";
"06 07 02 82 06 01 0A 02 02"	= "Τύποι πιστοποιητικών";
"06 07 02 82 06 01 0A 02 03"	= "Τύποι μηνυμάτων";
"06 07 02 82 06 01 0A 02 04"	= "Πρωτόκολλο PL";
"06 07 02 82 06 01 0A 02 05"	= "SME και συστατικά μέρη SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Χρήσιμοι ορισμοί";
"06 07 02 82 06 01 0A 02 08"	= "Αρχεία STE";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Ηλεκτρονική παραγγελία";
"06 07 02 82 06 01 0A 02 0B"	= "Ασύμμετρη εφαρμογή TTP Telesec";
"06 07 02 82 06 01 0A 02 0C"	= "Βασική εφαρμογή TTP Telesec";
"06 07 02 82 06 01 0A 02 0D"	= "Μηνύματα TTP Telesec";
"06 07 02 82 06 01 0A 02 0E"	= "Εφαρμογή σφραγίδας χρόνου TTP Telesec";

"06 06 02 82 06 01 0A 03"		= "Τάξη αντικειμένου";
"06 07 02 82 06 01 0A 03 00"	= "Άλλο όνομα Telesec";
"06 07 02 82 06 01 0A 03 01"	= "Κατάλογος";
"06 07 02 82 06 01 0A 03 02"	= "Τύπος καταλόγου";
"06 07 02 82 06 01 0A 03 03"	= "Ομάδα καταλόγου";
"06 07 02 82 06 01 0A 03 04"	= "Χρήστης καταλόγου";
"06 07 02 82 06 01 0A 03 05"	= "Εισαγωγή συμμετρικού κλειδιού";

"06 06 02 82 06 01 0A 04"		= "Πακέτο";
"06 06 02 82 06 01 0A 05"		= "Παράμετρος";
"06 06 02 82 06 01 0A 06"		= "Δέσμευση ονόματος";
"06 06 02 82 06 01 0A 07"		= "Χαρακτηριστικό";
"06 07 02 82 06 01 0A 07 00"	= "Αναγνωριστικό ομάδας εφαρμογής";
"06 07 02 82 06 01 0A 07 01"	= "Τύπος πιστοποιητικού";
"06 07 02 82 06 01 0A 07 02"	= "Πιστοποιητικό Telesec";
"06 07 02 82 06 01 0A 07 03"	= "Αριθμός πιστοποιητικού";
"06 07 02 82 06 01 0A 07 04"	= "Λίστα ανάκλησης πιστοποιητικών";
"06 07 02 82 06 01 0A 07 05"	= "Ημερομηνία δημιουργίας";
"06 07 02 82 06 01 0A 07 06"	= "Εκδότης";
"06 07 02 82 06 01 0A 07 07"	= "Αρχή ονοματοδοσίας";
"06 07 02 82 06 01 0A 07 08"	= "Κατάλογος δημόσιου κλειδιού";
"06 07 02 82 06 01 0A 07 09"	= "Τομέας ασφάλειας";
"06 07 02 82 06 01 0A 07 0A"	= "Θέμα";
"06 07 02 82 06 01 0A 07 0B"	= "Χρόνος ανάκλησης";
"06 07 02 82 06 01 0A 07 0C"	= "Αναφορά ομάδας χρήστη";
"06 07 02 82 06 01 0A 07 0D"	= "Εγκυρότητα";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Περιβάλλον μηνύματος ασφάλειας";
"06 07 02 82 06 01 0A 07 10"	= "Ανωνυμοποιημένος κατάλογος δημόσιου κλειδιού";
"06 07 02 82 06 01 0A 07 11"	= "Μικρό όνομα Telesec";
"06 07 02 82 06 01 0A 07 12"	= "Προσθήκες ονόματος";
"06 07 02 82 06 01 0A 07 13"	= "Ταχυδρομικός κωδικός Telesec";
"06 07 02 82 06 01 0A 07 14"	= "Διακριτής ονόματος";
"06 07 02 82 06 01 0A 07 15"	= "Λίστα πιστοποιητικών Telesec";
"06 07 02 82 06 01 0A 07 16"	= "Λίστα πιστοποιητικών Teletrust";
"06 07 02 82 06 01 0A 07 17"	= "Λίστα πιστοποιητικών X.509";
"06 07 02 82 06 01 0A 07 18"	= "Χρόνος έκδοσης";
"06 07 02 82 06 01 0A 07 19"	= "Αριθμός φυσικής κάρτας";
"06 07 02 82 06 01 0A 07 1A"	= "Τύπος αρχείου";
"06 07 02 82 06 01 0A 07 1B"	= "Το αρχείο Ctl είναι αρχειοθήκη";
"06 07 02 82 06 01 0A 07 1C"	= "Διεύθυνση email";
"06 07 02 82 06 01 0A 07 1D"	= "Λίστα προτύπων πιστοποιητικού";
"06 07 02 82 06 01 0A 07 1E"	= "Όνομα καταλόγου";
"06 07 02 82 06 01 0A 07 1F"	= "Όνομα τύπου καταλόγου";
"06 07 02 82 06 01 0A 07 20"	= "Όνομα ομάδας καταλόγου";
"06 07 02 82 06 01 0A 07 21"	= "Όνομα χρήστη καταλόγου";
"06 07 02 82 06 01 0A 07 22"	= "Σημαία ανάκλησης";
"06 07 02 82 06 01 0A 07 23"	= "Όνομα εισαγωγής συμμετρικού κλειδιού";
"06 07 02 82 06 01 0A 07 24"	= "Αριθμός GL";
"06 07 02 82 06 01 0A 07 25"	= "Αριθμός GO";
"06 07 02 82 06 01 0A 07 26"	= "Δεδομένα κλειδιού G";
"06 07 02 82 06 01 0A 07 27"	= "Δεδομένα κλειδιού Z";
"06 07 02 82 06 01 0A 07 28"	= "Δεδομένα κλειδιού KT";
"06 07 02 82 06 01 0A 07 2A"	= "Αριθμός κλειδιού KT";
"06 07 02 82 06 01 0A 07 33"	= "Παραγωγή χρόνου ανάκλησης";
"06 07 02 82 06 01 0A 07 34"	= "Κείμενο υπαιτιότητας";

"06 06 02 82 06 01 0A 08"		= "Ομάδα χαρακτηριστικών";
"06 06 02 82 06 01 0A 09"		= "Ενέργεια";
"06 06 02 82 06 01 0A 0A"		= "Ειδοποίηση";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Εφαρμογή ασφάλειας";

"06 06 02 82 06 01 0A 0C"		= "Ορισμοί επέκτασης Cert και CRL";

"06 07 02 82 06 01 0A 0C 00"	= "Επέκταση περιορισμού υπαιτιότητας επέκτασης πιστοποιητικού";
"06 07 02 82 06 01 0A 0C 01"	= "Επέκταση ID πιστοποιητικού Telesec";
"06 07 02 82 06 01 0A 0C 02"	= "Αναγνωριστικό πολιτικής Telesec";
"06 07 02 82 06 01 0A 0C 03"	= "ID προσδιοριστή πολιτικής Telesec";
"06 07 02 82 06 01 0A 0C 04"	= "Φιλτραρισμένη επέκταση CRL Telesec";
"06 07 02 82 06 01 0A 0C 05"	= "Επέκταση φίλτρου CRL Telesec";
"06 07 02 82 06 01 0A 0C 06"	= "Επέκταση αρχής ονοματοδοσίας Telesec";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "ID χρήστη";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "Θυρίδα RFC822";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Συστατικό μέρος τομέα";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Αριθμός επιχείρισης Αυστραλίας";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Αναγνωριστικό πολιτικής πιστοποιητικών Αυστραλίας";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Προσωπικά Signet";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Επιχείριση Signet";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Νομικά Signet";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Πιλότος Signet";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Αναγνωριστικό πολιτικής Signet";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Αλγόριθμος συμμετρικής κρυπτογράφησης";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "Αναγνωριστικό πολιτικής υψηλής διασφάλισης SEIS";
"06 06 2A 85 70 22 01 02"	= "Αναγνωριστικό πολιτικής GAK SEIS";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "Προσωπικό αναγνωριστικό AT SEIS";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "Υπομονάδα ANSI X9.57";
"06 07 2A 86 48 CE 38 01 01"	= "Διαχείριση πιστοποιητικών X9F1";
"06 06 2A 86 48 CE 38 02"		= "Οδηγία συγκράτησης";
"06 07 2A 86 48 CE 38 02 01"	= "Οδηγία συγκράτησης-Καμία";
"06 07 2A 86 48 CE 38 02 02"	= "Εκδότης κλήσης";
"06 07 2A 86 48 CE 38 02 03"	= "Απόρριψη";
"06 07 2A 86 48 CE 38 02 04"	= "Διαπιστευτήριο συλλογής";
"06 06 2A 86 48 CE 38 03"		= "Χαρακτηριστικό";
"06 06 2A 86 48 CE 38 03 01"	= "Προσυπογραφή";
"06 06 2A 86 48 CE 38 03 02"	= "Πιστοποιητικό χαρακτηριστικών";
"06 06 2A 86 48 CE 38 04"		= "Αλγόριθμος";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "Αντιστοίχιση DSA";
"06 07 2A 86 48 CE 38 04 03"	= "DSA με SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "Τύπος πεδίου ANSI X9.62";
"06 07 2A 86 48 CE 3D 01 01"	= "Κύριο πεδίο";
"06 07 2A 86 48 CE 3D 01 02"	= "Characteristic-Two Field";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Characteristic-Two Basis";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Κενή βάση";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Τριτοβάθμια βάση";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Πενταβάθμια βάση";
"06 06 2A 86 48 CE 3D 02"		= "Τύπος δημόσιου κλειδιού";
"06 07 2A 86 48 CE 3D 02 01"	= "Δημόσιο κλειδί ελλειπτικής καμπύλης";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "Τύπος πεδίου ANSI X9.42";
"06 07 2A 86 48 CE 3E 01 01"	= "Πεδίο πρωτοβάθμιου Galois";
"06 06 2A 86 48 CE 3E 02"		= "Τύπος αριθμού";
"06 07 2A 86 48 CE 3E 02 01"	= "Δημόσιο κλειδί Diffie-Hellman";
"06 06 2A 86 48 CE 3E 03"		= "Σχήμα";
"06 07 2A 86 48 CE 3E 03 01"	= "Στατικό Diffie-Hellman";
"06 07 2A 86 48 CE 3E 03 02"	= "Εφήμερο Diffie-Hellman";
"06 07 2A 86 48 CE 3E 03 03"	= "Υβρίδιο Diffie-Hellman 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Υβρίδιο Diffie-Hellman 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Έμπιστα στοιχεία έκδοσης";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE με MD5 και CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "MAC βασιζόμενο σε συνθηματικό";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Έμπιστος χρήστης";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Έμπιστα στοιχεία CA";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Πιστοποιητικό χαρακτηριστικών";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "Κρυπτογράφηση RSA";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 με κρυπτογράφηση RSA";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 με κρυπτογράφηση RSA";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 με κρυπτογράφηση RSA";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 με κρυπτογράφηση RSA";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "Κρυπτογράφηση RSA-OAEP (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "Κρυπτογράφηση RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "Καθορισμένο με ετικέτα RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "Σχήμα υπογραφής RSA-PSS";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 με κρυπτογράφηση RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 με κρυπτογράφηση RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 με κρυπτογράφηση RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 με κρυπτογράφηση RSA";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "Κρυπτογράφηση RSA BSAFE";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Συμφωνητικό κλειδιού Diffie-Hellman";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE με MD2 και DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE με MD5 και DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE με MD2 και RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE με MD5 και RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE με MD5 και XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE με SHA και DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Δεδομένα";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Υπογεγραμμένα δεδομένα";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Δεδομένα σε περίβλημα";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Δεδομένα με υπογραφή και περίβλημα";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Συνοπτικά δεδομένα";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Κρυπτογραφημένα δεδομένα";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Δεδομένα με χαρακτηριστικά";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Στοιχεία κρυπτογραφημένο ιδιωτικού κλειδιού";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "Διεύθυνση email";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Αδόμητο όνομα";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Τύπος περιεχομένου";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Σύνοψη μηνύματος";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Χρόνος υπογραφής";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Προσυπογραφή";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Πρόκληση συνθηματικού";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Αδόμητη διεύθυνση";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Εκτεταμένα χαρακτηριστικά πιστοποιητικού";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Εκδότης και αριθμός σειράς";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Έλεγχος συνθηματικού";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Δημόσιο κλειδί";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Περιγραφή υπογραφής";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Αίτημα επέκτασης";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "Δυνατότητες S/MIME";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Προτίμηση υπογεγραμμένων δεδομένων";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Δεν είναι δυνατή η αποκρυπτογράφηση ο,τιδήποτε";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Αίτημα απόδειξης";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Απόδειξη";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Υποδείξεις περιεχομένου";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Ιστορικό επέκτασης λίστας αλληλογραφίας";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "Υπομονάδες S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Κρυπτογραφική σύνταξη μηνύματος";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Ενισχυμένες υπηρεσίες ασφάλειας";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "Αναγνωριστικό αντικειμένου S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "Μήνυμα S/MIME V3";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "Ηλεκτρονική υπογραφή 88 ETS";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "Ηλεκτρονική υπογραφή 97 ETS";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "Πολιτική ηλεκτρονικής υπογραφής 88 ETS";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "Πολιτική ηλεκτρονικής υπογραφής 97 ETS";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "Τύποι περιεχομένου S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "Χαρακτηριστικά με ελεγχμένη ταυτότητα S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "d-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "d-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "Αλγόριθμοι S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "Διανομή πιστοποιητικού S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "Διανομή πιστοποιητικού LDAP";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "Προσδιοριστής πολιτικής υπογραφής S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "Αναγνωριστικό τύπου υπογραφής S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Υπογραφή εντολέα";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Υπογραφή τομέα";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Πρόσθετη υπογραφή χαρακτηριστικών";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Υπογραφή αναθεώρησης";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "Δυνατότητες S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Προτίμηση δυαδικού εσωτερικά";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Φιλικό όνομα (για PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "ID τοπικού κλειδιού (για PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Τύποι πιστοποιητικών (για PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "Πιστοποιητικό X.509 (για PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "Πιστοποιητικό SDSI (για PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "Τύποι CRL (για PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL (για PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "Σύνταξη ανταλλαγής προσωπικών στοιχείων PKCS-12";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "Αναγνωριστικά κρυπτογράφησης με βάση συνθηματικό PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE με SHA-1 και 128-Bit RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE με SHA-1 και 40-Bit RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE με SHA-1 και τριπλό DES-CBC 3 κλειδιών";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE με SHA-1 και τριπλό DES-CBC 2 κλειδιών";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE με SHA-1 και 128-Bit RC2-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE με SHA-1 και 40-Bit RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "Αναγνωριστικά ESPVK PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "Προστατευτικό κλειδιού PKCS-8 PKCS-12";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "Αναγνωριστικά σάκου PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "Αναγνωριστικό σάκου κλειδιού PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "Αναγνωριστικό σάκου πιστοποιητικού και CRL PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "Αναγνωριστικό μυστικού σάκου PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "Αναγνωριστικό ασφαλούς περιεχομένου PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "Αναγνωριστικό προστατευμένου σάκου κλειδιού PKCS-8 PKCS-12";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "Αναγνωριστικό σάκου πιστοποιητικού PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "Αναγνωριστικό σάκου πιστοποιητικού και CRL X.509 PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "Αναγνωριστικό σάκου πιστοποιητικού SDSI PKCS-12";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "Αναγνωριστικό κρυπτογράφησης με βάση συνθηματικό PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PBE με SHA-1 και 128-Bit RC4 PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PBE με SHA-1 και 40-Bit RC4 PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PBE με SHA-1 και τριπλό DES-CBC PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PBE με SHA-1 και 128-Bit RC2-CBC PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PBE με SHA-1 και 40-Bit RC2-CBC PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PBE με SHA-1 και RC4 PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PBE με SHA-1 και RC2-CBC PKCS-12";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "Αναγνωριστικά περιβλήματος PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "Κρυπτογράφηση RSA με 128-Bit RC4 PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "Κρυπτογράφηση RSA με 40-Bit RC4 PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "Κρυπτογράφηση RSA με τριπλό DES PKCS-12";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "Αναγνωριστικό υπογραφής PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "Υπογραφή RSA με σύνοψη SHA-1 PKCS-12";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 Έκδοση 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "Αναγνωριστικά σάκου PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "Σάκος κλειδιού PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "Προστατευμένος σάκος κλειδιού PKCS-8 PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "Σάκος πιστοποιητικού PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "Σάκος CRL PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "Μυστικός σάκος PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "Σάκος ασφαλούς περιεχομένου PKCS-12";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "Υπομονάδες PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "Χαρακτηριστικά PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "Τύπος περιεχομένου PKCS-15";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "Περιεχόμενο PKCS-15";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "Αλγόριθμος σύνοψης RSADSI";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC με SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "Αλγόριθμος κρυπτογράφησης RSADSI";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 με MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC Pad";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Αναγνωριστικό άγνωστης πολιτικής Identrus";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "Διαχρηστικό Kerberos MIT";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Τάξη αντικειμένου Microsoft Exchange Server";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Διευθυνσιοδότηση τοποθεσίας";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Σχήματα τάξης";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Σχήματα χαρακτηριστικών";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Θυρίδα-Πράκτορας";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Θυρίδα";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Υποδοχέας";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Παραλήπτης Mail";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Μηχανισμός παράδοσης";

"06 07 2A 86 48 86 F7 14 04"				= "Μορφές αρχείων Microsoft";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Authenticode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "Έμμεσο πλαίσιο δεδομένων SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "Στοιχεία πρακτορείου SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "Τύπος δήλωσης SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "Πληροφορίες Opus SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "Επεκτάσεις πιστοποιητικού SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "Δεδομένα εικόνας PE SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "Σύνδεσμος SPC (τύπος 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Μεμονωμένη υπογραφή κώδικα";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Υπογραφή εμπορικού κώδικα";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "Σύνδεσμος SPC (τύπος 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "Ελάχιστα κριτήρια SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "Οικονομικά κριτήρια SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "Σύνδεσμος SPC (τύπος 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "Πάροχος υποστήριξης ασφάλειας NTLM";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Προσυπογραφή σφραγίδας χρόνου";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Έμπιστη λίστα πιστοποιητικών";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Ταξινομημένη επέκταση CTL";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Τοποθεσία επόμενης ενημέρωσης";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Ενισχυμένη χρήση κλειδιού";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Υπογραφή έμπιστης λίστας πιστοποιητικών";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Υπογραφή σφραγίδας χρόνου";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Κρυπτογράφηση με πύλη διακομιστή";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Σειριακοποιημένη κρυπτογράφηση";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Συστήματα κρυπτογραφημένων αρχείων";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Ανάκτηση συστημάτων κρυπτογραφημένων αρχείων";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Συμβατό με εξοπλισμό Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "Υπογραφή NT5";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Υπογραφή OEM εξοπλισμού Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Υπογραφή Embedded NT";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Υπογραφή έμπιστης λίστας ρίζας";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Αξιολογημένη ως κατάλληλη υπόταξη";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Ανάκτηση κλειδιού";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Υπογραφή εγγράφου";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Αναγνωριστικά αντικειμένων χαρακτηριστικών";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Χαρακτηριστικό εμπιστοσύνης Ναι/Όχι";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft Music DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Εξατομίευση DRM Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Άδειες Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Διακομιστής άδειας Microsoft";

"06 08 2B 06 01 04 01 82 37 0D"				= "Αναγνωριστικά αντικειμένων PKCS-10 Microsoft";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Πιστοποιητικό ανανέωσης";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Ζεύγος ονόματος/τιμής εγγραφής";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "CSP εγγραφής";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "Έκδοση OS";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Χαρακτηριστικά PKCS-12 Microsoft";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Σετ κλειδιών τοπικού μηχανήματος";

"06 08 2B 06 01 04 01 82 37 14"				= "Υποδομή εγγραφής Microsoft";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Χρήση CTL αυτοεγγραφής";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Τύπος πιστοποιητικού εγγραφής";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Πράκτορας εγγραφής";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Είσοδος Smartcard";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "Πρωτεύον όνομα NT";

"06 08 2B 06 01 04 01 82 37 15"				= "Υποδομή διακομιστή πιστοποιητικού Microsoft";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Έκδοση ανανέωσης CA Microsoft";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "Έκδοση CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 02"			= "Χαρακτηριστικό CAPICOM";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Όνομα εγγράφου";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Περιγραφή εγγράφου";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Κρυπτογραφημένα δεδομένα";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Κρυπτογραφημένο περιεχόμενο";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "Αναγνωριστικό πολιτικής UNINETT";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "Αναγνωριστικό πολιτικής ICE-TEL";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "Αναγνωριστικό πολιτικής CA ICE-TEL";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal με SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal με RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "Χαρακτηριστικά cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "Έλεγχος παρουσίας cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "RTCS ανταπόκρισης OCSP";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "Εκτεταμένο RTCS ανταπόκρισης OCSP";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "Εκτεταμένη αιτία CRL";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Βασικές δυνατότητες";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "Εκκίνηση PKI";
"06 09 2B 06 01 04 01 97 55 04 01"			= "Περιεχόμενο cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "Δεδομένα διαμόρφωσης cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "Ευρετήριο χρήστη cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "Στοιχεία χρήστη cryptlib";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "Αναγνωριστικό πολιτικής XYZZY";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Απρόσβλητο από το χρόνο";
"06 08 2B 06 01 04 01 AA 60 01"		= "Σύστημα υπογραφής χρόνου";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Σύστημα υπογραφής χρόνου 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Σύστημα υπογραφής χρόνου 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Σύστημα υπογραφής χρόνου 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Δευτερεύουσες πρακτικές";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Αναγνωριστικά θεραπευτών";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos V5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Δεδομένα ελέγχου ταυτότητας Kerberos";
"06 07 2B 06 01 05 02 03 02"        = "Δεδομένα κλειδιού Diffie-Hellman Kerberos";
"06 07 2B 06 01 05 02 03 03"        = "Δεδομένα κλειδιού απάντησης Kerberos";
"06 07 2B 06 01 05 02 03 04"        = "Έλεγχος ταυτότητας πελάτη Kerberos";
"06 07 2B 06 01 05 02 03 05"        = "Kerberos Key Distribution Center (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "Simple Public Key Mechanism (SPKM)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Υποδομή δημόσιου κλειδιού";

"06 07 2B 06 01 05 05 07 01"		= "Επεκτάσεις ιδιωτικού πιστοποιητικού PKIX";
"06 08 2B 06 01 05 05 07 01 01"		= "Πρόσβαση πληροφοριών αρχής πιστοποιητικού";
"06 08 2B 06 01 05 05 07 01 02"		= "Βιομετρικά στοιχεία";
"06 08 2B 06 01 05 05 07 01 03"		= "Αξιολογημένες ως κατάλληλες δηλώσεις πιστοποιητικού";
"06 08 2B 06 01 05 05 07 01 04"		= "Ταυτότητα ελέγχου πιστοποιητικού χαρακτηριστικών";
"06 08 2B 06 01 05 05 07 01 05"		= "Στόχευση πιστοποιητικού χαρακτηριστικών";
"06 08 2B 06 01 05 05 07 01 06"		= "Έλεγχοι αρχής πιστοποιητικού χαρακτηριστικών";
"06 08 2B 06 01 05 05 07 01 07"		= "Φραγή διεύθυνσης IP SBGP";
"06 08 2B 06 01 05 05 07 01 08"		= "Αναγνωριστικό αυτόνομου συστήματος SBGP";
"06 08 2B 06 01 05 05 07 01 09"		= "Αναγνωριστικό δρομολογητή SBGP";
"06 08 2B 06 01 05 05 07 01 0A"		= "Μεσολάβηση πιστοποιητικού χαρακτηριστικών";
"06 08 2B 06 01 05 05 07 01 0B"		= "Πρόσβαση στοιχείων θέματος";
"06 08 2B 06 01 05 05 07 01 0C"		= "Λογότυπο";

"06 07 2B 06 01 05 05 07 02"		= "Τύποι προσδιοριστικού πολιτικής";
"06 08 2B 06 01 05 05 07 02 01"		= "Δήλωση πρακτικής πιστοποιητικών";
"06 08 2B 06 01 05 05 07 02 02"		= "Ειδοποίηση χρήστη";
"06 08 2B 06 01 05 05 07 02 03"		= "Ειδοποίηση κειμένου";

"06 07 2B 06 01 05 05 07 03"		= "Σκοπός κλειδιού";
"06 08 2B 06 01 05 05 07 03 01"		= "Ταυτοποίηση διακομιστή";
"06 08 2B 06 01 05 05 07 03 02"		= "Ταυτοποίηση πελάτη";
"06 08 2B 06 01 05 05 07 03 03"		= "Υπογραφή κώδικα";
"06 08 2B 06 01 05 05 07 03 04"		= "Προστασία email";
"06 08 2B 06 01 05 05 07 03 05"		= "Ακραίο σύστημα IPSEC";
"06 08 2B 06 01 05 05 07 03 06"		= "Σήραγγα IPSEC";
"06 08 2B 06 01 05 05 07 03 07"		= "Χρήστης IPSEC";
"06 08 2B 06 01 05 05 07 03 08"		= "Σφραγίδα χρόνου";
"06 08 2B 06 01 05 05 07 03 09"		= "Υπογραφή OCSP";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "Έλεγχος ταυτότητας διακομιστή AA SBGP";

"06 07 2B 06 01 05 05 07 04"		= "Τύποι στοιχείων CMP";
"06 08 2B 06 01 05 05 07 04 01"		= "Πιστοποιητικό κρυπτογράφησης πρωτοκόλλου CA";
"06 08 2B 06 01 05 05 07 04 02"		= "Τύποι ζεύγους κλειδιού υπογραφής";
"06 08 2B 06 01 05 05 07 04 03"		= "Τύποι ζεύγους κλειδιού κρυπτογράφησης";
"06 08 2B 06 01 05 05 07 04 04"		= "Προτιμώμενος συμμετρικός αλγόριθμος";
"06 08 2B 06 01 05 05 07 04 05"		= "Στοιχεία ενημέρωσης κλειδιού CA";
"06 08 2B 06 01 05 05 07 04 06"		= "Τρέχον CRL";
"06 08 2B 06 01 05 05 07 04 07"		= "Μη υποστηριζόμενα OID";
"06 08 2B 06 01 05 05 07 04 08"		= "Αίτημα συνδρομής";
"06 08 2B 06 01 05 05 07 04 09"		= "Ανταπόκριση συνδρομής";
"06 08 2B 06 01 05 05 07 04 0A"		= "Αίτημα παραμέτρου ζεύγους κλειδιού";
"06 08 2B 06 01 05 05 07 04 0B"		= "Ανταπόκριση παραμέτρου ζεύγους κλειδιού";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "Καταχώρηση CRMF";
"06 08 2B 06 01 05 05 07 05 01"		= "Έλεγχος καταχώρησης";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Διαπιστευτήριο καταχώρησης";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Ελεγκτής ταυτότητας";
"06 09 2B 06 01 05 05 07 05 01 03"	= "Στοιχεία δημοσίευσης PKI";
"06 09 2B 06 01 05 05 07 05 01 04"	= "Επιλογές αρχειοθέτησης PKI";
"06 09 2B 06 01 05 05 07 05 01 05"	= "Αναγνωριστικό παλαιού πιστοποιητικού";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Κλειδί κρυπτογράφησης πρωτοκόλλου";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Εναλλακτικό πρότυπο πιστοποιητικού";
"06 09 2B 06 01 05 05 07 05 01 08"	= "Πρότυπο WAP WTLS";

"06 08 2B 06 01 05 05 07 05 02"		= "Πληροφορίες καταχώρησης CRMF";
"06 09 2B 06 01 05 05 07 05 02 01"	= "Ζεύγη UTF-8";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Αίτηση πιστοποιητικού";

"06 07 2B 06 01 05 05 07 06"		= "Αλγόριθμοι";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Καμία υπογραφή";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "Έλεγχοι CMC";

"06 07 2B 06 01 05 05 07 08"		= "Άλλα ονόματα";
"06 08 2B 06 01 05 05 07 08 01"		= "Προσωπικά δεδομένα";
"06 08 2B 06 01 05 05 07 08 02"		= "Ομάδα χρήστη";

"06 07 2B 06 01 05 05 07 09"		= "Προσωπικά δεδομένα";
"06 08 2B 06 01 05 05 07 09 01"		= "Ημερομηνία γέννησης";
"06 08 2B 06 01 05 05 07 09 02"		= "Τόπος γέννησης";
"06 08 2B 06 01 05 05 07 09 03"		= "Ψευδώνυμο";
"06 08 2B 06 01 05 05 07 09 04"		= "Φύλο";
"06 08 2B 06 01 05 05 07 09 05"		= "Χώρα υπηκοότητας";
"06 08 2B 06 01 05 05 07 09 06"		= "Χώρα κατοικίας";

"06 07 2B 06 01 05 05 07 0A"		= "Πιστοποιητικό χαρακτηριστικών";
"06 08 2B 06 01 05 05 07 0A 01"		= "Στοιχεία ελέγχου ταυτότητας";
"06 08 2B 06 01 05 05 07 0A 02"		= "Αναγνωριστικό πρόσβασης";
"06 08 2B 06 01 05 05 07 0A 03"		= "Ταυτότητα φόρτισης";
"06 08 2B 06 01 05 05 07 0A 04"		= "Ομάδα";
"06 08 2B 06 01 05 05 07 0A 05"		= "Ρόλος";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Πρωτόκολλο Online Certificate Status (OCSP)";
"06 09 2B 06 01 05 05 07 30 01 01"	= "Βασική ανταπόκριση OCSP";
"06 09 2B 06 01 05 05 07 30 01 02"	= "Τωρινή επέκταση OCSP";
"06 09 2B 06 01 05 05 07 30 01 03"	= "Αναφορά CRL OCSP";
"06 09 2B 06 01 05 05 07 30 01 04"	= "Ανταπόκριση OCSP";
"06 09 2B 06 01 05 05 07 30 01 05"	= "Έλεγχος καμίας ανάκλησης OCSP";
"06 09 2B 06 01 05 05 07 30 01 06"	= "Αποκοπή αρχειοθέτησης OCSP";
"06 09 2B 06 01 05 05 07 30 01 07"	= "Εντοπιστής υπηρεσίας OCSP";

"06 08 2B 06 01 05 05 07 30 02"		= "Εκδότες CA";
"06 08 2B 06 01 05 05 07 30 03"		= "Σφραγίδα χρόνου";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "Ενδιάμεσο IKE";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "Αλγόριθμος κρυπτογράφησης DEC";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "Αλγόριθμος Hash DEC";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "Αλγόριθμος υπογραφής DEC";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 με RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 με RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 με RSA";
"06 05 2B 0E 03 02 03"				= "MD5 με RSA";
"06 05 2B 0E 03 02 04"				= "MD4 με κρυπτογράφηση RSA";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N με RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "Υπογραφή RSA";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA με SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 με υπογραφή RSA";
"06 05 2B 0E 03 02 0F"				= "SHA με υπογραφή RSA";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman με κοινό μέτρο";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "Κοινό DSA";
"06 05 2B 0E 03 02 15"				= "Κοινό DSA με SHA";
"06 05 2B 0E 03 02 16"				= "Μεταφορά κλειδιού RSA";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 με υπογραφή RSA";
"06 05 2B 0E 03 02 19"				= "MD5 με υπογραφή RSA";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA με SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA με κοινό SHA-1";
"06 05 2B 0E 03 02 1D"				= "SHA-1 με κρυπτογράφηση RSA";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 με RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 με ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Έγγραφο";
"06 04 2B 24 01 01"					= "Τελική έκδοση";
"06 04 2B 24 01 02"					= "Προσχέδιο";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Αλγόριθμος";
"06 04 2B 24 03 01"					= "Αλγόριθμος κρυπτογράφησης";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB Pad";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "Κρυπτογράφηση RSA";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad";

"06 04 2B 24 03 02"					= "Αλγόριθμος Hash";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "Μονό μήκος MDC2";
"06 05 2B 24 03 02 05"				= "Διπλό μήκος MDC2";
"06 04 2B 24 03 03"					= "Αλγόριθμος υπογραφής";
"06 05 2B 24 03 03 01"				= "Υπογραφή RSA";

"06 06 2B 24 03 03 01 01"			= "Υπογραφή RSA με SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "Υπογραφή RSA με SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "Υπογραφή RSA με SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "Υπογραφή RSA με SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "Υπογραφή RSA με SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "Υπογραφή RSA με SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "Υπογραφή RSA με SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "Υπογραφή RSA με SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "Υπογραφή RSA με SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "Υπογραφή RSA με SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "Υπογραφή RSA με SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "Υπογραφή RSA με SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "Υπογραφή RSA με SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "Υπογραφή RSA με SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "Υπογραφή RSA με SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "Υπογραφή RSA με SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "Υπογραφή RSA με SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "Υπογραφή RSA με SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "Υπογραφή RSA με SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "Υπογραφή RSA με SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "Υπογραφή RSA με SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "Υπογραφή RSA με SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "Υπογραφή RSA με SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "Υπογραφή RSA με SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "Υπογραφή RSA με SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "Υπογραφή RSA με SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "Υπογραφή RSA με RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "Υπογραφή RSA με RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "Υπογραφή RSA με RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "Υπογραφή RSA με RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "Υπογραφή RSA με RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "Υπογραφή RSA με RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "Υπογραφή RSA με RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "Υπογραφή RSA με RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "Υπογραφή RSA με RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "Υπογραφή RSA με RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "Υπογραφή RSA με RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "Υπογραφή RSA με RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "Υπογραφή RSA με RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "Υπογραφή RSA με RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "Υπογραφή RSA με RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "Υπογραφή RSA με RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "Υπογραφή RSA με RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "Υπογραφή RSA με RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "Υπογραφή RSA με RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "Υπογραφή RSA με RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "Υπογραφή RSA με RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "Υπογραφή RSA με RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "Υπογραφή RSA με RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "Υπογραφή RSA με RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "Υπογραφή RSA με RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "Υπογραφή RSA με RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "Υπογραφή RSA με RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "Υπογραφή RSA με RIPEMD-256";

"06 05 2B 24 03 03 02"				= "Υπογραφή ECSIE";
"06 06 2B 24 03 03 02 01"			= "Υπογραφή ECSIE με SHA-1";
"06 06 2B 24 03 03 02 02"			= "Υπογραφή ECSIE με RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "Υπογραφή ECSIE με MD2";
"06 06 2B 24 03 03 02 04"			= "Υπογραφή ECSIE με MD5";

"06 04 2B 24 03 04"					= "Σχήμα υπογραφής";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 με RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 με RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 με RND";

"06 03 2B 24 04"					= "Χαρακτηριστικό";
"06 03 2B 24 05"					= "Πολιτική";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "API ειδικό του κατασκευαστή";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "API ειδικό της λειτουργικότητας";
"06 03 2B 24 07"					= "Διαχείριση κλειδιών";
"06 04 2B 24 07 01"					= "Συμφωνητικό κλειδιού";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Μεταφορά κλειδιού";
"06 05 2B 24 07 02 01"				= "ISO9796-2 με κρυπτογράφηση RSA";

"06 05 2B 24 08 01 01"				= "Αναγνωριστικό πολιτικής SigiSigConform Teletrust";
"06 05 2B 24 08 02 01"				= "Υπηρεσία καταλόγου";

"06 05 2B 24 08 03 01"				= "Παραγωγή ημερομηνίας πιστοποιητικού";
"06 05 2B 24 08 03 02"				= "Προμήθευση";
"06 05 2B 24 08 03 03"				= "Αποδοχή εισόδου";
"06 05 2B 24 08 03 04"				= "Νομισματικό όριο";
"06 05 2B 24 08 03 05"				= "Δήλωση της πλειοψηφίας";
"06 05 2B 24 08 03 06"				= "Αριθμός σειράς κάρτας ολοκληρωμένου κυκλώματος";
"06 05 2B 24 08 03 07"				= "Αναφορά δημόσιου κλειδιού";
"06 05 2B 24 08 03 08"				= "Περιορισμός";
"06 05 2B 24 08 03 09"				= "Ανάκτηση αν επιτρέπεται";
"06 05 2B 24 08 03 0A"				= "Αιτούμενο πιστοποιητικό";
"06 05 2B 24 08 03 0B"				= "Αρχές ονοματοδοσίας";
"06 05 2B 24 08 03 0C"				= "Πιστοποιητικό στον κατάλογο από";
"06 05 2B 24 08 03 0D"				= "Hash πιστοποιητικού";

"06 05 2B 24 08 04 01"				= "Προσωπικά δεδομένα";
"06 05 2B 24 08 04 08"				= "Περιορισμός";
"06 07 2B 24 08 05 01 01 01"		= "SHA-1 ένδειξης RSA";
"06 07 2B 24 08 05 01 01 02"		= "RIPEMD-160 ένδειξης RSA";
"06 07 2B 24 08 05 01 01 03"		= "RSA με SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA με RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "Εκτεταμένο DSA";
"06 07 2B 24 08 05 01 02 02"		= "DSA με RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Πιστοποιητικό";
"06 05 2B 24 08 06 02"				= "Αναφορά πιστοποιητικού";
"06 05 2B 24 08 06 03"				= "Πιστοποιητικό χαρακτηριστικών";
"06 05 2B 24 08 06 04"				= "Αναφορά χαρακτηριστικών";
"06 05 2B 24 08 06 05"				= "Όνομα αρχείου";
"06 05 2B 24 08 06 06"				= "Χρόνος αποθήκευσης";
"06 05 2B 24 08 06 07"				= "Μέγεθος αρχείου";
"06 05 2B 24 08 06 08"				= "Τοποθεσία";
"06 05 2B 24 08 06 09"				= "Αριθμός υπογραφής";
"06 05 2B 24 08 06 0A"				= "Αυτοπαραγόμενο";

"06 05 2B 24 08 07 01"				= "Τύποι παρουσιάσεων Teletrust";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Δυαδικά";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Σχέδιο";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Κείμενο";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Επέκταση πιστοποιητικού Thawte";
"06 05 2B 65 01 04 01"				= "Ισχυρό Extranet";

/* X.520 */

"06 02 55 04"		= "Τύποι χαρακτηριστικών X.520";
"06 03 55 04 00"	= "Τάξη αντικειμένου";
"06 03 55 04 01"	= "Όνομα εισόδου με ψευδώνυμο";
"06 03 55 04 02"	= "Πληροφορίες γνώσης";
"06 03 55 04 03"	= "Κοινό όνομα";
"06 03 55 04 04"	= "Επώνυμο";
"06 03 55 04 05"	= "Αριθμός σειράς";
"06 03 55 04 06"	= "Όνομα χώρας";
"06 03 55 04 07"	= "Όνομα τοποθεσίας";
"06 04 55 04 07 01"	= "Συλλογικό όνομα τοποθεσίας";
"06 03 55 04 08"	= "Πολιτεία ή επαρχία";
"06 04 55 04 08 01"	= "Συλλογικό όνομα πολιτείας ή επαρχίας";
"06 03 55 04 09"	= "Διεύθυνση";
"06 04 55 04 09 01"	= "Συλλογική διεύθυνση";
"06 03 55 04 0A"	= "Όνομα οργανισμού";
"06 04 55 04 0A 01"	= "Συλλογικό όνομα οργανισμού";
"06 03 55 04 0B"	= "Μονάδα οργάνωσης";
"06 04 55 04 0B 01"	= "Συλλογικό όνομα μονάδας οργανισμού";
"06 03 55 04 0C"	= "Τίτλος";
"06 03 55 04 0D"	= "Περιγραφή";
"06 03 55 04 0E"	= "Οδηγός αναζήτησης";
"06 03 55 04 0F"	= "Κατηγορία επιχειρήσεων";
"06 03 55 04 10"	= "Ταχυδρομική διεύθυνση";
"06 04 55 04 10 01"	= "Συλλογική ταχυδρομική διεύθυνση";
"06 03 55 04 11"	= "Ταχυδρομικός κωδικός";
"06 04 55 04 11 01"	= "Συλλογικός ταχυδρομικός κωδικός";
"06 03 55 04 12"	= "Ταχυδρομική θυρίδα";
"06 04 55 04 12 01"	= "Συλλογική ταχυδρομική θυρίδα";
"06 03 55 04 13"	= "Όνομα γραφείου φυσικής παράδοσης";
"06 04 55 04 13 01"	= "Συλλογικό όνομα γραφείου φυσικής παράδοσης";
"06 03 55 04 14"	= "Τηλεφωνικός αριθμός";
"06 04 55 04 14 01"	= "Συλλογικός τηλεφωνικός αριθμός";
"06 03 55 04 15"	= "Αριθμός Telex";
"06 04 55 04 15 01"	= "Συλλογικός αριθμός Telex";
"06 03 55 04 16"	= "Αναγνωριστικό τερματικού Teletex";
"06 04 55 04 16 01"	= "Συλλεκτικό αναγνωριστικό τερματικού Teletex";
"06 03 55 04 17"	= "Αριθμός fax";
"06 04 55 04 17 01"	= "Συλλογικός αριθμός fax";
"06 03 55 04 18"	= "Διεύθυνση X.121";
"06 03 55 04 19"	= "Διεθνής αριθμός ISDN";
"06 04 55 04 19 01"	= "Συλλογικός διεθνής αριθμός ISDN";
"06 03 55 04 1A"	= "Καταχωρημένη διεύθυνση";
"06 03 55 04 1B"	= "Ένδειξη προορισμού";
"06 03 55 04 1C"	= "Προτιμώμενη μέθοδος παράδοσης";
"06 03 55 04 1D"	= "Διεύθυνση παρουσίασης";
"06 03 55 04 1E"	= "Υποστηριζόμενο πλαίσιο εφαρμογής";
"06 03 55 04 1F"	= "Μέλος";
"06 03 55 04 20"	= "Κάτοχος";
"06 03 55 04 21"	= "Ένοικος ρόλου";
"06 03 55 04 22"	= "Βλ. επίσης";
"06 03 55 04 23"	= "Συνθηματικό χρήστη";
"06 03 55 04 24"	= "Πιστοποιητικό χρήστη";
"06 03 55 04 25"	= "Πιστοποιητικό CA";
"06 03 55 04 26"	= "Λίστα ανάκλησης αρχών";
"06 03 55 04 27"	= "Λίστα ανάκλησης πιστοποιητικών";
"06 03 55 04 28"	= "Ζεύγος διασταυρούμενου πιστοποιητικού";
"06 03 55 04 29"	= "Όνομα";
"06 03 55 04 2A"	= "Μικρό όνομα";
"06 03 55 04 2B"	= "Αρχικά";
"06 03 55 04 2C"	= "Προσδιοριστής γενιάς";
"06 03 55 04 2D"	= "Μοναδικό αναγνωριστικό";
"06 03 55 04 2E"	= "Προσδιοριστής DN";
"06 03 55 04 2F"	= "Οδηγός ενισχυμένης αναζήτησης";
"06 03 55 04 30"	= "Στοιχεία πρωτοκόλλου";
"06 03 55 04 31"	= "Διακεκριμένο όνομα";
"06 03 55 04 32"	= "Μοναδικό μέλος";
"06 03 55 04 33"	= "Αναγνωριστικό οίκου";
"06 03 55 04 34"	= "Αλγόριθμοι που υποστηρίζονται";
"06 03 55 04 35"	= "Λίστα ανάκλησης Delta";
"06 03 55 04 36"	= "Εκκαθάριση";
"06 03 55 04 3A"	= "Ζεύγος διασταυρούμενου πιστοποιητικού";

/* X.500 object classes */

"06 02 55 06"		= "Τάξη αντικειμένου X.520";
"06 03 55 06 00"	= "Άνω";
"06 03 55 06 01"	= "Ψευδώνυμο";
"06 03 55 06 02"	= "Χώρα";
"06 03 55 06 03"	= "Τοποθεσία";
"06 03 55 06 04"	= "Οργανισμός";
"06 03 55 06 05"	= "Μονάδα οργάνωσης";
"06 03 55 06 06"	= "Άτομο";
"06 03 55 06 07"	= "Άτομο οργάνωσης";
"06 03 55 06 08"	= "Ρόλος οργάνωσης";
"06 03 55 06 09"	= "Ομάδα ονομάτων";
"06 03 55 06 0A"	= "Αστικό άτομο";
"06 03 55 06 0B"	= "Επεξεργασία εφαρμογής";
"06 03 55 06 0C"	= "Οντότητα εφαρμογής";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Συσκευή";
"06 03 55 06 0F"	= "Χρήστης ισχυρού ελέγχου ταυτότητας";
"06 03 55 06 10"	= "Αρχή πιστοποιητικού";
"06 03 55 06 11"	= "Ομάδα μοναδικών ονομάτων";
"06 03 55 06 15"	= "Χρήστης PKI";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "Αλγόριθμοι X.500";
"06 03 55 08 01"	= "Αλγόριθμοι κρυπτογράφησης X.500";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "Επεκτάσεις πιστοποιητικών X.509";
"06 03 55 1D 01"	= "Αναγνωριστικό κλειδιού αρχής (παλιό)";
"06 03 55 1D 02"	= "Χαρακτηριστικά πρωτεύοντος κλειδιού (παλιό)";
"06 03 55 1D 03"	= "Πολιτικές πιστοποιητικού (παλιό)";
"06 03 55 1D 04"	= "Περιορισμός χρήσης κλειδιού (παλιό)";
"06 03 55 1D 05"	= "Απεικόνιση πολιτικής (παλιό)";
"06 03 55 1D 06"	= "Περιορισμός υποδένδρων";
"06 03 55 1D 07"	= "Εναλλακτικό όνομα θέματος (παλιό)";
"06 03 55 1D 08"	= "Εναλλακτικό όνομα εκδότη (παλιό)";
"06 03 55 1D 09"	= "Χαρακτηριστικά καταλόγου θέματος";
"06 03 55 1D 0A"	= "Βασικοί περιορισμοί (παλιό 2.5.29.10)";
"06 03 55 1D 0B"	= "Περιορισμοί ονόματος (παλιό)";
"06 03 55 1D 0C"	= "Περιορισμοί πολιτικής (παλιό)";
"06 03 55 1D 0D"	= "Βασικοί περιορισμοί (παλιό 2.5.29.13)";
"06 03 55 1D 0E"	= "Αναγνωριστικό κλειδιού θέματος";
"06 03 55 1D 0F"	= "Χρήση κλειδιού";
"06 03 55 1D 10"	= "Περίοδος χρήσης ιδιωτικού κλειδιού";
"06 03 55 1D 11"	= "Εναλλακτικό όνομα θέματος";
"06 03 55 1D 12"	= "Εναλλακτικό όνομα εκδότη";
"06 03 55 1D 13"	= "Βασικοί περιορισμοί";
"06 03 55 1D 14"	= "Αριθμός λίστας ανάκλησης πιστοποιητικών";
"06 03 55 1D 15"	= "Κώδικας αιτίας CRL";
"06 03 55 1D 16"	= "Ημερομηνία λήξης (παλιό)";
"06 03 55 1D 17"	= "Κωδικός οδηγίας συγκράτησης";
"06 03 55 1D 18"	= "Ημερομηνία ακυρότητας";
"06 03 55 1D 19"	= "Σημεία διανομής CRL (παλιό)";
"06 03 55 1D 1A"	= "Έκδοση σημείου διανομής (παλιό)";
"06 03 55 1D 1B"	= "Ένδειξη CRL Delta";
"06 03 55 1D 1C"	= "Έκδοση σημείου διανομής";
"06 03 55 1D 1D"	= "Εκδότης πιστοποιητικού";
"06 03 55 1D 1E"	= "Περιορισμοί ονόματος";
"06 03 55 1D 1F"	= "Σημεία διανομής CRL";
"06 03 55 1D 20"	= "Πολιτικές πιστοποιητικού";
"06 04 55 1D 20 00"	= "Οποιοδήποτε αναγνωριστικό πολιτικής";
"06 03 55 1D 21"	= "Απεικονίσεις πολιτικής";
"06 03 55 1D 22"	= "Περιορισμοί πολιτικής";
"06 03 55 1D 23"	= "Αναγνωριστικό κλειδιού αρχής";
"06 03 55 1D 24"	= "Περιορισμοί πολιτικής";
"06 03 55 1D 25"	= "Εκτεταμένη χρήση κλειδιού";
"06 04 55 1D 25 00"	= "Οποιαδήποτε εκτεταμένη χρήση κλειδιού";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "Αλγόριθμος υπογραφής SDNS";
"06 09 60 86 48 01 65 02 01 01 02"	= "Αλγόριθμος υπογραφής Fortezza";
"06 09 60 86 48 01 65 02 01 01 03"	= "Αλγόριθμος εμπιστευτικότητας SDNS";
"06 09 60 86 48 01 65 02 01 01 04"	= "Αλγόριθμος εμπιστευτικότητας Fortezza";
"06 09 60 86 48 01 65 02 01 01 05"	= "Αλγόριθμος ακεραιότητας SDNS";
"06 09 60 86 48 01 65 02 01 01 06"	= "Αλγόριθμος ακεραιότητας Fortezza";
"06 09 60 86 48 01 65 02 01 01 07"	= "Αλγόριθμος προστασίας διαπιστευτηρίου SDNS";
"06 09 60 86 48 01 65 02 01 01 08"	= "Αλγόριθμος προστασίας διαπιστευτηρίου Fortezza";
"06 09 60 86 48 01 65 02 01 01 09"	= "Αλγόριθμος διαχείρισης κλειδιών SDNS";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Αλγόριθμος διαχείρισης κλειδιών Fortezza";
"06 09 60 86 48 01 65 02 01 01 0B"	= "Αλγόριθμος διαχείρισης κλειδιών και υπογραφής SDNS";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Αλγόριθμος διαχείρισης κλειδιών και υπογραφής Fortezza";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Αλγόριθμος υπογραφής Suite A";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Αλγόριθμος εμπιστευτικότητας Suite A";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Αλγόριθμος ακεραιότητας Suite A";
"06 09 60 86 48 01 65 02 01 01 10"	= "Αλγόριθμος προστασίας διαπιστευτηρίου Suite A";
"06 09 60 86 48 01 65 02 01 01 11"	= "Αλγόριθμος διαχείρισης κλειδιών Suite A";
"06 09 60 86 48 01 65 02 01 01 12"	= "Αλγόριθμος διαχείρισης κλειδιών και υπογραφής Suite A";
"06 09 60 86 48 01 65 02 01 01 13"	= "Ενημερωμένος αλγόριθμος υπογραφής Fortezza";
"06 09 60 86 48 01 65 02 01 01 14"	= "Αλγόριθμοι διαχείρισης κλειδιών και ενημερωμένης υπογραφής Fortezza";
"06 09 60 86 48 01 65 02 01 01 15"	= "Ενημερωμένος αλγόριθμος ακεραιότητας Fortezza";
"06 09 60 86 48 01 65 02 01 01 16"	= "Αλγόριθμος ανταλλαγής κλειδιού";
"06 09 60 86 48 01 65 02 01 01 17"	= "Αλγόριθμος Wrap80 Fortezza";
"06 09 60 86 48 01 65 02 01 01 18"	= "Key Encryption Algorithm (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "Μορφή μηνύματος RFC 822";
"06 09 60 86 48 01 65 02 01 02 02"	= "Κενό περιεχόμενο";
"06 09 60 86 48 01 65 02 01 02 03"	= "Τύπος περιεχομένου CSP";
"06 09 60 86 48 01 65 02 01 02 2A"	= "Τύπος περιεχομένου MSP Rev 3";
"06 09 60 86 48 01 65 02 01 02 30"	= "Τύπος περιεχομένου MSP";
"06 09 60 86 48 01 65 02 01 02 31"	= "Πρωτόκολλο πράκτορα νέου κλειδιού MSP";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "Τύπος περιεχομένου MSP Rev 3.1";
"06 09 60 86 48 01 65 02 01 02 48"	= "Τμήμα κύριου κειμένου προωθημένου μηνύματος MSP";
"06 09 60 86 48 01 65 02 01 02 49"	= "Παράμετροι προωθημένου μηνύματος MSP";
"06 09 60 86 48 01 65 02 01 02 50"	= "Τμήμα κύριου κειμένου προωθημένου μηνύματος CSP";
"06 09 60 86 48 01 65 02 01 02 51"	= "Παράμετροι προωθημένου μηνύματος CSP";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "Πολιτική ασφάλειας SDNS";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Πολιτική ασφάλειας";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Γενικά";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Προεπιλεγμένη πολιτική ασφάλειας";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "Πιστοποιητικό διαχείρισης κλειδιών SDNS";
"06 09 60 86 48 01 65 02 01 05 02"	= "Πιστοποιητικό υπογραφής χρήστη SDNS";
"06 09 60 86 48 01 65 02 01 05 03"	= "Πιστοποιητικό διαχείρισης κλειδιών και υπογραφής SDNS";
"06 09 60 86 48 01 65 02 01 05 04"	= "Πιστοποιητικό διαχείρισης κλειδιών Fortezza";
"06 09 60 86 48 01 65 02 01 05 05"	= "Πιστοποιητικό διαχείρισης κλειδιών και υπογραφής Fortezza";
"06 09 60 86 48 01 65 02 01 05 06"	= "Πιστοποιητικό υπογραφής χρήστη Fortezza";
"06 09 60 86 48 01 65 02 01 05 07"	= "Πιστοποιητικό υπογραφής CA Fortezza";
"06 09 60 86 48 01 65 02 01 05 08"	= "Πιστοποιητικό υπογραφής CA SDNS";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Βοηθητικό διάνυσμα";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Πολιτική αποδείξεων";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Ιδιότητα μέλους";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Διαχειριστές";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "CKL υπογραφής Meta SDNS";
"06 09 60 86 48 01 65 02 01 05 2B"	= "CKL υπογραφής SDNS";
"06 09 60 86 48 01 65 02 01 05 2C"	= "Λίστα ανάκλησης πιστοποιητικών SDNS";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Λίστα ανάκλησης πιστοποιητικών Fortezza";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Επεξεργαστής εξαιρούμενης διεύθυνσης";
"06 09 60 86 48 01 65 02 01 05 30"	= "Φρουρός";
"06 09 60 86 48 01 65 02 01 05 31"	= "Αλγόριθμοι που υποστηρίζονται";
"06 09 60 86 48 01 65 02 01 05 32"	= "Πιστοποιητικό διαχείρισης κλειδιών Suite A";
"06 09 60 86 48 01 65 02 01 05 33"	= "Πιστοποιητικό διαχείρισης κλειδιών και υπογραφής Suite A";
"06 09 60 86 48 01 65 02 01 05 34"	= "Πιστοποιητικό υπογραφής χρήστη Suite A";
"06 09 60 86 48 01 65 02 01 05 35"	= "Στοιχεία PRBAC";
"06 09 60 86 48 01 65 02 01 05 36"	= "Περιορισμοί CA PRBAC";
"06 09 60 86 48 01 65 02 01 05 37"	= "Δικαιώματα διαχείρισης υπογραφών ή κλειδιών";
"06 09 60 86 48 01 65 02 01 05 38"	= "Δικαιώματα επικοινωνίας";
"06 09 60 86 48 01 65 02 01 05 39"	= "Χαρακτηριστικό με ετικέτα";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Αρχείο στοιχείων πολιτικής";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Αρχείο στοιχείων πολιτικής Sec";
"06 09 60 86 48 01 65 02 01 05 3C"	= "Περιορισμός εκκαθάρισης CA";

"06 09 60 86 48 01 65 02 01 07 01"		= "Επεκτάσεις CSP";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "Κατηγορίες ασφάλειας ISSI";
"06 09 60 86 48 01 65 02 01 08 02"		= "Τυπικά δικαιώματα ετικέτας ασφάλειας";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Δικαιώματα υπογραφών";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Δικαιώματα διαχείρισης κλειδιών";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Δικαίωμα επώνυμου σετ ετικετών";
"06 09 60 86 48 01 65 02 01 0B 01"			= "Επίδειξη ΗΒ";
"06 09 60 86 48 01 65 02 01 0B 02"			= "Υπουργείο Άμυνας ΗΠΑ Τάξη 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "Μεσαίος πιλότος ΗΠΑ";
"06 09 60 86 48 01 65 02 01 0B 04"			= "Υπουργείο Άμυνας ΗΠΑ Τάξη 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "Υπουργείο Άμυνας ΗΠΑ Τάξη 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "Υπουργείο Άμυνας ΗΠΑ Τάξη 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "Υπουργείο Άμυνας ΗΠΑ Τάξη 3 PKI";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Δοκιμή πολιτικής ασφάλειας";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "Σετ ετικετών μηδέν TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "Σετ ετικετών ένα TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "Σετ ετικετών δύο TSP1";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "Κατηγορίες ασφάλειας TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "Σετ ετικετών μηδέν TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "Σετ ετικετών ένα TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "Σετ ετικετών δύο TSP2";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Κατηγορίες ασφάλειας Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Όνομα σετ ετικετών Kafka 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Όνομα σετ ετικετών Kafka 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Όνομα σετ ετικετών Kafka 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Δοκιμή εισόδου CRL";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Ετικέτα";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "Αναγνωριστικό πολιτικής GAK";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "Αναγνωριστικό στοιχειώδους πολιτικής FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "Αναγνωριστικό βασικής πολιτικής FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "Αναγνωριστικό μεσαίας πολιτικής FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "Αναγνωριστικό υψηλής πολιτικής FBCA";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "Κλειδί KRA";
"06 08 60 86 48 01 65 03 02 03"			= "Επεκτάσεις";
"06 09 60 86 48 01 65 03 02 03 01"		= "Τεχνική ανάκτησης κλειδιού";
"06 09 60 86 48 01 65 03 02 03 02"		= "Με δυνατότητα ανάκτησης κλειδιού";
"06 09 60 86 48 01 65 03 02 03 03"		= "Ανάκτηση κλειδιού";
"06 08 60 86 48 01 65 03 02 04"			= "Σχήματα ανάκτησης κλειδιού";
"06 08 60 86 48 01 65 03 02 05"			= "Επέκταση GAK CSOR";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "Αλγόριθμος NIST";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-CFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Αλγόριθμος Novell";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 με BSAFE1 κρυπτογράφησης RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 με BSAFE1 κρυπτογράφησης RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 με BSAFE1 κρυπτογράφησης RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "Σύνοψη LM";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC με SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC με MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "Πακέτο MD4";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "BSAFE1 κρυπτογράφησης RSA";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "Συνθηματικό NW";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "Τύπος χαρακτηριστικού PKI";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Χαρακτηριστικά ασφάλειας";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Όριο εξάρτησης";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Αναγνωριστικό αντικειμένου Netscape";
"06 08 60 86 48 01 86 F8 42 01"		= "Επέκταση πιστοποιητικού Netscape";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Τύπος πιστοποιητικού Netscape";
"06 09 60 86 48 01 86 F8 42 01 02"	= "URL βάσης Netscape";
"06 09 60 86 48 01 86 F8 42 01 03"	= "URL ανάκλησης Netscape";
"06 09 60 86 48 01 86 F8 42 01 04"	= "URL ανάκλησης CA Netscape";
"06 09 60 86 48 01 86 F8 42 01 05"	= "URL λήψης CRL Netscape";
"06 09 60 86 48 01 86 F8 42 01 06"	= "URL λήψης πιστοποιητικού CA Netscape";
"06 09 60 86 48 01 86 F8 42 01 07"	= "URL ανανέωσης πιστοποιητικού Netscape";
"06 09 60 86 48 01 86 F8 42 01 08"	= "URL πολιτικής CA Netscape";
"06 09 60 86 48 01 86 F8 42 01 09"	= "URL αρχικής σελίδας πιστοποιητικού Netscape";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Λογότυπο οντότητας πιστοποιητικού Netscape";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Εικόνα χρήστη πιστοποιητικού Netscape";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Όνομα διακομιστή SSL Netscape";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Σχόλιο πιστοποιητικού Netscape";

"06 08 60 86 48 01 86 F8 42 02"		= "Τύπος δεδομένων Netscape";
"06 09 60 86 48 01 86 F8 42 02 01"	= "εικόνα/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "εικόνα/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "κείμενο/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Ακολουθία πιστοποιητικού Netscape";
"06 09 60 86 48 01 86 F8 42 02 06"	= "URL πιστοποιητικού Netscape";

"06 08 60 86 48 01 86 F8 42 03"			= "Αναγνωριστικό αντικειμένου καταλόγου Netscape";
"06 09 60 86 48 01 86 F8 42 03 01"		= "Ορισμοί LDAP";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Άδεια κυκλοφορίας";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Αριθμός τμήματος";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Αριθμός εργαζόμενου";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Τύπος εργαζόμενου";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Άτομο οργάνωσης Intranet";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Κρυπτογράφηση με πύλη διακομιστή";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Άγνωστη επέκταση VPN Verisign";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Άγνωστη επέκταση VPN Verisign";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Αναγνωριστικό πολιτικής Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Ειδοποίηση CPS v1 Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "Τύπος περιεχομένου";
"06 04 67 2A 00 00"	= "Δεδομένα PAN";
"06 04 67 2A 00 01"	= "Διαπιστευτήριο PAN";
"06 04 67 2A 00 02"	= "PAN μόνο";

"06 03 67 2A 01"	= "Επέκταση μηνύματος";
"06 03 67 2A 02"	= "Πεδίο";
"06 04 67 2A 02 00"	= "Πλήρες όνομα";
"06 04 67 2A 02 01"	= "Μικρό όνομα";
"06 04 67 2A 02 02"	= "Επώνυμο";
"06 04 67 2A 02 03"	= "Επώνυμο οικογένειας";
"06 04 67 2A 02 04"	= "Όνομα μέρους";
"06 04 67 2A 02 05"	= "Αναγνωριστικός αριθμός";
"06 04 67 2A 02 06"	= "Μήνας";
"06 04 67 2A 02 07"	= "Ημερομηνία";
"06 04 67 2A 02 08"	= "Διεύθυνση";
"06 04 67 2A 02 09"	= "Τηλέφωνο";
"06 04 67 2A 02 0A"	= "Ποσότητα";
"06 04 67 2A 02 0B"	= "Αριθμός λογαριασμού";
"06 04 67 2A 02 0C"	= "Φράση πρόσβασης";

"06 03 67 2A 03"		= "Χαρακτηριστικό";
"06 04 67 2A 03 00"		= "Πιστοποιητικό";
"06 05 67 2A 03 00 00"	= "Αποτύπωμα αντίχειρα κλειδιού ρίζας";
"06 05 67 2A 03 00 01"	= "Πρόσθετη πολιτική";

"06 03 67 2A 04"	= "Αλγόριθμος";
"06 03 67 2A 05"	= "Πολιτική";
"06 04 67 2A 05 00"	= "Ρίζα";
"06 03 67 2A 06"	= "Υπομονάδα";
"06 03 67 2A 07"	= "Επέκταση πιστοποιητικού";
"06 04 67 2A 07 00"	= "Κλειδί ρίζας με hash";
"06 04 67 2A 07 01"	= "Τύπος πιστοποιητικού";
"06 04 67 2A 07 02"	= "Δεδομένα εμπόρου";
"06 04 67 2A 07 03"	= "Απαιτείται πιστοποιητικό κάρτας";
"06 04 67 2A 07 04"	= "Σηράγγωση";
"06 04 67 2A 07 05"	= "Επεκτάσεις SET";
"06 04 67 2A 07 06"	= "Προσδιοριστής SET";

"06 03 67 2A 08"	= "Μάρκα";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Προμηθευτής";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Εμπιστοσύνη";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Εθνικό";
"06 05 67 2A 0A E2 00"	= "Ιαπωνία";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Κλειδί ρίζας με hash";
"06 04 86 8D 6F 03"	= "Τύπος πιστοποιητικού";
"06 04 86 8D 6F 04"	= "Δεδομένα εμπόρου";
"06 04 86 8D 6F 05"	= "Απαιτείται πιστοποιητικό κάρτας";
"06 04 86 8D 6F 06"	= "Σηράγγωση";
"06 04 86 8D 6F 07"	= "Προσδιοριστής SET";
"06 04 86 8D 6F 63"	= "Δεδομένα SET";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Ασφάλεια δεδομένων Apple";

"06 08 2A 86 48 86 F7 63 64 01" = "Αναγνωριστικό πολιτικής εμπιστοσύνης Apple";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Πολιτική iSign Apple";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Βασική πολιτική X.509 Apple";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Πολιτική SSL Apple";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Πολιτική τοπικής παραγωγής πιστοποιητικού Apple";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Πολιτική τοπικής παραγωγής CSR Apple";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Πολιτική ανάκλησης CRL Apple";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Πολιτική ανάκλησης OCSP Apple";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Πολιτική S/MIME Apple";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Πολιτική επεκτάσιμου ελέγχου ταυτότητας Apple";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Πολιτική υπογραφής ενημέρωσης λογισμικού Apple";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Πολιτική IPsec Apple";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Πολιτική iChat Apple";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Πολιτική υπογραφής πόρων Apple";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Πολιτική πελάτη Kerberos Apple";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Πολιτική διακομιστή Kerberos Apple";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Πολιτική υπογραφής κώδικα Apple";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Πολιτική υπογραφής πακέτου Apple";

"06 08 2A 86 48 86 F7 63 64 02" = "Αναγνωριστικό αλγόριθμού ασφάλειας Apple";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "Fast Elliptic Encryption (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Apple Secure Compression (ASC)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE με υπογραφή MD5";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE με υπογραφή SHA-1";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Κρυπτογράφηση FEED Apple";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (Πειραματικό)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE με υπογραφή ECDSA";

"06 08 2A 86 48 86 F7 63 64 03" = "Αναγνωριστικό πιστοποιητικού .Mac Apple";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Αίτημα πιστοποιητικού .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Αίτημα πιστοποιητικού ταυτότητας .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Αίτημα πιστοποιητικού υπογραφής email .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Αίτημα πιστοποιητικού κρυπτογράφησης email .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Αίτημα λίστας αρχειοθήκης .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Αίτημα αποθήκευσης αρχειοθήκης .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Αίτημα μετάκλησης αρχειοθήκης .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Αίτημα αφαίρεσης αρχειοθήκης .Mac Apple";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Επέκταση πιστοποιητικού .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Ταυτότητα .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Υπογραφή email .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Κρυπτογράφηση email .Mac Apple";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Τιμή αιτήματος πιστοποιητικού .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Όνομα χρήστη";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Συνθηματικό";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Όνομα host";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Σημαία ανανέωσης";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Ασύγχρονη σημαία";

"06 08 2A 86 48 86 F7 63 64 04" = "Εκτεταμένη χρήση κλειδιού Apple";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Υπογραφή κώδικα Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Υπογραφή κώδικα Apple (ανάπτυξη)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Υπογραφή ενημέρωσης λογισμικού Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Υπογραφή κώδικα Apple (με κράτηση)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Υπογραφή πόρων Apple";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Υπογραφή iChat Apple";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Κρυπτογράφηση iChat Apple";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Αναγνωριστικό συστήματος Apple";

"06 08 2A 86 48 86 F7 63 64 05" = "Πολιτικές πιστοποιητικού Apple";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Πολιτική πιστοποιητικού Apple";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Πολιτική πιστοποιητικού .Mac Apple";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Υπογραφή κώδικα";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Ασφάλεια CDSA Intel";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Μορφές αλγόριθμων ασφάλειας CDSA Intel";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "Επεκτάσεις πιστοποιητικών X.509v3";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Επεκτάσεις ιδιωτικών πιστοποιητικών X.509v3";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Bitmap υπογραφής θέματος";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Εικόνα θέματος";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Διεύθυνση email θέματος";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Χρήση εξαιρέσεων";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Αλγόριθμοι ασφάλειας CDSA Intel";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 με ECDSA";

/* end */
